Autodesk.Revit.DB.CurveElement.GetLineStyleIds
Retrieves the set of available line style Element Ids.
Returns: A collection of ElementIds of line styles. The members will be the ids of Autodesk.Revit.DB.GraphicsStyle elements.
These graphics styles should be associated to subcategories of the BuiltInCategory OST_Lines.
Since: 2013

Autodesk.Revit.DB.CurveElement.CurveElementType
The curve element type.

Autodesk.Revit.DB.CurveElement
Represents a curve element in Autodesk Revit.  This could be a Model Line,Detail Line, or other specialty curve such as a Room Boundary Line.